#+TITLE:     Presentation of Scientific Results
#+AUTHOR:    Arnaud Legrand
#+DATE: Performance Evaluation Lecture
#+STARTUP: beamer overview indent
#+TAGS: noexport(n)
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [11pt,xcolor=dvipsnames,presentation]
#+OPTIONS:   H:3 num:t toc:nil \n:nil @:t ::t |:t ^:nil -:t f:t *:t <:t
#+LATEX_HEADER: \input{org-babel-style-preembule.tex}

#+LaTeX: \input{org-babel-document-preembule.tex}


*** Why do we need to visualize ? The Anscombe's Quartet         :noexport:
#+begin_src R :results output :session :exports none
library(ggplot2)
library(plyr)
library(reshape)
anscombe$idx=1:length(anscombe$x1) 
a = melt(anscombe,id=c("idx"))
a$set=gsub("[^0-9]*","",as.character(a$variable))
a$variable=gsub("[0-9]*","",as.character(a$variable))
a = cast(a, idx+set~variable, mean) 
# library(ggplot2)
# library(dplyr)
# library(tidyr)
# anscombe$idx=1:length(anscombe$x1) 
# a = anscombe %>% gather(variable, value,-idx)
# a$set=gsub("[^0-9]*","",as.character(a$variable))
# a$variable=gsub("[0-9]*","",as.character(a$variable))
# a %>% spread(set,variable)
a = cast(a, idx+set~variable, mean) 
#+end_src

#+RESULTS:
: 
: Attachement du package : ‘reshape’
: 
: The following objects are masked from ‘package:plyr’:
: 
:     rename, round_any
: Erreur : Casting formula contains variables not found in molten data: variable

#+LaTeX: \begin{columns}\begin{column}{.4\linewidth}
#+begin_src R :results output :session :exports output
a1=a[a$set==1,c("x","y")]
a2=a[a$set==2,c("x","y")]
a1
#+end_src

#+RESULTS:
#+begin_example
    x     y
1  10  8.04
5   8  6.95
9  13  7.58
13  9  8.81
17 11  8.33
21 14  9.96
25  6  7.24
29  4  4.26
33 12 10.84
37  7  4.82
41  5  5.68
#+end_example

#+LaTeX: \end{column}\begin{column}{.6\linewidth}
#+begin_src R :results output :session :exports both
summary(a1)
summary(a2)
#+end_src

#+RESULTS:
#+begin_example
       x              y         
 Min.   : 4.0   Min.   : 4.260  
 1st Qu.: 6.5   1st Qu.: 6.315  
 Median : 9.0   Median : 7.580  
 Mean   : 9.0   Mean   : 7.501  
 3rd Qu.:11.5   3rd Qu.: 8.570  
 Max.   :14.0   Max.   :10.840
       x              y        
 Min.   : 4.0   Min.   :3.100  
 1st Qu.: 6.5   1st Qu.:6.695  
 Median : 9.0   Median :8.140  
 Mean   : 9.0   Mean   :7.501  
 3rd Qu.:11.5   3rd Qu.:8.950  
 Max.   :14.0   Max.   :9.260
#+end_example

#+LaTeX: \end{column}\end{columns}

